{
  "name": {
    "swe": "Svenskt frasnät (SweFN)",
    "eng": "Swedish FrameNet (SweFN)"
  },
  "short_description": {
    "swe": "En lexikal-semantisk resurs baserad på samma principer som engelska Berkeley FrameNet. Denna resurs är fullständig i den bemärkelse att den innehåller både det semantiska och det syntaktiska innehållet. ",
    "eng": "A lexical semantic resource based on the same principles as the English Berkeley FrameNet. It is the complete resource containing both the semantic and the syntactic content. "
  },
  "type": "lexicon",
  "trainingdata": false,
  "unlisted": false,
  "language_codes": [
    "swe"
  ],
  "size": {
    "Semantic frames": "1195"
  },
  "in_collections": [],
  "downloads": [
    {
      "url": "https://spraakbanken.gu.se/lb/resurser/meningsmangder/swefn-full.zip",
      "type": "corpus",
      "format": "XML",
      "info": "",
      "licence": "CC BY 4.0",
      "restriction": "attribution"
    }
  ],
  "interface": [],
  "contact_info": {
    "surname": "Dannélls",
    "givenName": "Dana",
    "email": "sb-info@svenska.gu.se",
    "affiliation": {
      "organisation": "Språkbanken Text",
      "email": "sb-info@svenska.gu.se"
    }
  },
  "description": {
    "swe": "",
    "eng": "<table style=\"width:100%\">\n<tr>\n<td>I. IDENTIFYING INFORMATION</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Title*</td>\n<td>Swedish FrameNet v1.0\n</td>\n</tr>\n<tr>\n<td>Subtitle</td>\n<td> Swedish FrameNet for describing and documenting Swedish lexical entries, containing sentences annotated manually with semantic information and automatically with morphosyntactic information. \n</td>\n</tr>\n<tr>\n<td>Created by*</td>\n<td>Dana Dannélls (dana.dannells@svenska.gu.se), Maria Toporowska Gronostaj, Karin Friberg Heppin, and others.   \n</td>\n</tr>\n<tr>\n<td>Publisher(s)*</td>\n<td>Språkbanken Text (sb-info@svenska.gu.se)\n</td>\n</tr>\n<tr>\n<td>Link(s) / permanent identifier(s)*</td>\n<td>https://spraakbanken.gu.se/en/resources/swefn-full\n</td>\n</tr>\n<tr>\n<td>License(s)*</td>\n<td>CC BY 4.0\n</td>\n</tr>\n<tr>\n<td>Abstract*</td>\n<td> Swedish FrameNet (SweFN) is a multi-layered lexical, grammatical and semantic computational resource based on the theory of frame semantics. The resource was created within the <a href=\"https://spraakbanken.gu.se/projekt/swedish-framenet-swefn\">Swedish FrameNet++ project</a>. It has been developed in line with Berkeley FrameNet 1.5. In SweFN sentences are annotated manually with semantic information and automatically with morphosyntactic annotations. The resource contains 1,195 semantic frames, 39,212 lexical units linked to Saldo and 9,020 semantically and syntactically annotated sentences. \n</td>\n</tr>\n<tr>\n<td>Funded by*</td>\n<td>The Swedish Research Council (grant no. 2010–06013) and several other <a href=\" https://spraakbanken.gu.se/forskning/teman/swedish-framenet-plus-plus/bidragande-projekt\">contributing projects</a>\n</td>\n</tr>\n<tr>\n<td>Cite as</td>\n<td> [1], [2]\n</td>\n</tr>\n<tr>\n<td>Related datasets</td>\n<td>SweFN has links to several lexical resources at Språkbanken Text: <a href=\"https://spraakbanken.gu.se/en/resources/dalin\">Dalin</a>, <a href=\"https://spraakbanken.gu.se/en/resources/lwt\">Loan Word Typology list</a>, <a href=\"https://spraakbanken.gu.se/en/resources/parolelexplus\">Parole+</a>, <a href=\"https://spraakbanken.gu.se/en/resources/saldo\">Saldo</a>, <a href=\"https://spraakbanken.gu.se/en/resources/simpleplus\">Simple+</a>, <a href=\"https://spraakbanken.gu.se/en/resources/swesaurus\">Swesaurus</a>.\n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>II. USAGE</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Key applications</td>\n<td>Information retrieval, Machine translation, Natural language generation, Question answering, Semantic role labeling, Text classification, Textual entailment, Word sense disambiguation. \n</td>\n</tr>\n<tr>\n<td>Intended task(s)/usage(s)</td>\n<td>Train and evaluate machine learning models, develop semantic role labeling systems.\n</td>\n</tr>\n<tr>\n<td>Recommended evaluation measures</td>\n<td>Precision, Recall, F-score\n</td>\n</tr>\n<tr>\n<td>Dataset function(s)</td>\n<td>Training, testing, development\n</td>\n</tr>\n<tr>\n<td>Recommended split(s)</td>\n<td>10-fold cross-validation. \n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>III. DATA</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Primary data*</td>\n<td>Text\n</td>\n</tr>\n<tr>\n<td>Language*</td>\n<td>Swedish\n</td>\n</tr>\n<tr>\n<td>Dataset in numbers*</td>\n<td>1,195 Frames, 39,210 Lexical Units and 9,020 semantically and syntactically annotated sentences.\n</td>\n</tr>\n<tr>\n<td>Nature of the content*</td>\n<td>\n  Similarly to the Berkeley FrameNet, the Swedish FrameNet is build around semantic frames for describing and documenting Swedish lexical entries. It contains frame elements (FE) and lexical units (LU). A semantic frame represents factual information about concepts and situations in our world through frame elements. LU are words or multiword expressions are defined as a pairing of a word with a sense. They analyzed with frame elements and are documented with their syntactic relations with help av example sentences.\n<br>\n  Swedish FrameNet contains several layers of annotations, divided into two xml files: (1) one containing information about the semantic properties of the LUs and the semantic analysis of the sentences in which they appear. That is the manual annotation. (2) one containing information about the frame, frame elements, domain, lexical units and the linguistic analysis automatically processed in Sprav pipeline, including the syntactic structure of each sentence, the morphological and other lexical descriptions (sense,sentiment score) of the lexical units.\n</td>\n</tr>\n<tr>\n<td>Format*</td>\n<td>The format of both files (semantic and morphosyntatic annotations) are in XML. There are 20 data fields specified in the semantic file 'swefn.xml':\n1.  The name of the frame,\n2. Definition,\n3. Core elements,\n4. Peripheral elements,\n5. SweCxn ID,\n6. Semantic type,\n7. Example sentences,\n8. Compound patterns,\n9. Compound examples,\n10. Lexical units (LUs),\n11. Suggestions for LUs,\n12. Regular polysemy,\n13. Domain,\n14. Inheritance,\n15. Berkeley Frame ID, \n16. Berkeley LUs,\n17. Created by,\n18. Comment,\n19. Status,\n20. Modification date.\n</td>\n</tr>\n<tr>\n<td>Data source(s)*</td>\n<td>Sentences in SweFN have been extracted from the Web and from corpus examples. They have been annotated with manually with semantic information and automatically with morphosyntactic information using Sparv v4.1. Lexical units have been linked to Saldo v2.3 using Karp editing interface.  \n</td>\n</tr>\n<tr>\n<td>Data collection method(s)*</td>\n<td>Sentences and lexical units have been extracted manually and semi-automatically. Frames in SweFN have been developed by taking two approaches: extension and merging. \n</td>\n</tr>\n<tr>\n<td>Data selection and filtering*</td>\n<td>\n  As a result of the collection methods of frames, there are 59 frames in SweFN that do not have an exact match in BFN. Out of these, 20 are modified versions of BFN frames, revised mainly by splitting the original English frames into more specific ones [5].\n</td>\n</tr>\n<tr>\n<td>Data preprocessing*</td>\n<td>\n  The majority of sentences have been annotated through Karp's editing interface. Some sentences may have been shortened. Each of the data files has been preprocessed seperatly, one in Karp v5 and one in Sparv v4.1. \n</td>\n</tr>\n<tr>\n<td>Data labeling*</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Annotator characteristics</td>\n<td>Approximately 10 annotators have been involved in the semantic annotation work. Some had background in linguistics, some in computational linguistics and a few in lexicography. All annotators had at least undergraduate degree. \n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>IV. ETHICS AND CAVEATS</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Ethical considerations</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Things to watch out for</td>\n<td> All frames are linked to Berkely FrameNet v1.7. \n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>V. ABOUT DOCUMENTATION</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Data last updated*</td>\n<td>2021-12-21, v1.0\n</td>\n</tr>\n<tr>\n<td>Which changes have been made, compared to the previous version*</td>\n<td>This is the first official version. \n</td>\n</tr>\n<tr>\n<td>Access to previous versions</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>This document created*</td>\n<td>2021-12-21, Dana Dannélls\n</td>\n</tr>\n<tr>\n<td>This document last updated*</td>\n<td>2021-12-21, Dana Dannélls\n</td>\n</tr>\n<tr>\n<td>Where to look for further details</td>\n<td>[1], [2]\n</td>\n</tr>\n<tr>\n<td>Documentation template version*</td>\n<td>v1.0\n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>VI. OTHER</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>Related projects</td>\n<td> See complete list of <a href=\"https://spraakbanken.gu.se/en/research/themes/swedish-framenet-plus-plus/contributing-projects\">contributing projects</a>.  \n</td>\n</tr>\n<tr>\n<td></td>\n<td>\n</td>\n</tr>\n<tr>\n<td>References</td>\n<td>[1] Dana Dannélls, Lars Borin, Markus Forsberg, Karin Friberg Heppin, Maria Toporowska Gronostaj (2021): Swedish FrameNet. The Swedish FrameNet++. Harmonization, integration, method development and practical language technology applications, pages 37--66. \n  <br> [2] Dana Dannélls, Lars Borin, Karin Friberg Heppin (2021): The Swedish FrameNet++ Harmonization, integration, method development and practical language technology applications. John Benjamins: Amsterdam, Philadelphia. ISBN 978 90 272 5848 9.\n  <br> [3] Dana Dannélls, Karin Friberg Heppin, Anna Ehrlemark (2014): Using language technology resources and tools to construct Swedish FrameNet. In Proceedings of the Workshop on Lexical and Grammatical Resources for Language Processing, pages 8--17, Dublin: ACL. \n  <br> [4] Karin Friberg Heppin, Miriam R.L. Petruck (2014): Encoding of Compounds in Swedish FrameNet. In Proceedings of the 10th Workshop on Multiword Expressions (MWE 2014) Workshop at EACL 2014 (Gothenburg, Sweden). Association for Computational Linguistics, pages 67--71, Gothenburg: ACL.\n  <br> [5] Friberg Heppin, Karin & Maria Toporowska Gronostaj (2014). Exploiting FrameNet for Swedish: Mismatch? Constructions and Frames 6(1): 52–72. \n   <br> [6] Karin Friberg Heppin (2013): Search using semantic FrameNet frames as variables. In Proceedings of Sixth Workshop on Exploiting Semantic Annotations in Information Retrieval (ESAIR 2013), held at CIKM 2013 in San Francisco, pages 25--28.\n   <br> [7] Kaarlo Voionmaa, Karin Friberg Heppin (2013): Use of support verbs in FrameNet annotations. In Electronic lexicography in the 21st century: thinking outside the paper. Proceedings of the eLex 2013 conference, Tallinn, Estonia.\n    <br> [8] Richard Johansson, Karin Friberg Heppin, Dimitrios Kokkinakis (2012): Semantic Role Labeling with the Swedish FrameNet. In Proceedings of the Eighth International Conference on Language Resources and Evaluation (LREC'12); Istanbul, Turkey, pages 3697--3700.\n    <br> [9] Dana Dannélls, Lars Borin (2012): Toward language independent methodology for generating artwork descriptions – Exploring FrameNet information. In EACL 2012 workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities (LaTeCH), pages 18–23. Avignon: ACL.\n     <br> [10] Karin Friberg Heppin, Kaarlo Voionmaa (2012): Practical aspects of transferring the English Berkeley FrameNet to other languages. In Proceedings of SLTC 2012, 28–29. Lund: Lund University.\n     <br> [11] Dimitrios Kokkinakis (2012): Initial Experiments of Medication Event Extraction Using Frame Semantics. In Scandinavian Conference on Health Informatics (SHI), volym Linköping Electronic Conference Proceedings, pages 41--47. Linköping: LiUEP.\n     <br> [12] Richard Johansson (2012): Non-atomic Classification to Improve a Semantic Role Labeler for a Low-resource Language. In Proceedings of the First Joint Conference on Lexical and Computational Semantics (*SEM), Montréal, Canada, pages 95--99.\n     <br> [13] Lyngfelt, Benjamin, Lars Borin, Markus Forsberg, Julia Prentice, Rudolf Rydstedt, Emma Sköldberg & Sofia Tingsell. 2012. Adding a constructicon to the Swedish resource network of Språkbanken. In Proceedings of KONVENS 2012 (LexSem 2012 workshop), 452–461. Vienna: ÖGAI.\n      <br> [14] Lars Borin, Markus Forsberg, Richard Johansson, Kristiina Muhonen, Tanja Purtonen, Kaarlo Voionmaa (2012): Transferring Frames: Utilization of Linked Lexical Resources. In Proceedings of the Workshop on Inducing Linguistic Structure Submission (WILS), pages 8--15. Montrèal: ACL.\n      <br> [15] Dimitrios Kokkinakis, Maria Toporowska Gronostaj (2010): Linking SweFN++ with Medical Resources, towards a MedFrameNet for Swedish. In Proceedings of Louhi at NAACL-HLT 2010, pages 68–71. Los Angeles: ACL. \n       <br> [16] Dana Dannélls (2010): Applying semantic frame theory to automate natural language templates generation from ontology statements. In Proceedings of INLG 2010, 179–184. Dublin: ACL. \n       <br> [17] Lars Borin, Dana Dannélls, Markus Forsberg, Maria Toporowska Gronostaj, Dimitrios Kokkinakis (2009): Thinking Green: Toward Swedish FrameNet++. Presentation at the FrameNet Masterclass and Workshop in connection with TLT 2009. Milan. \n</td>\n</tr>\n</table>\n"
  }
}